droidecahedron/nrf54_radio_latency_test/sci/src/main.c
/*
 * Copyright (c) 2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <string.h>
#include <zephyr/console/console.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/util.h>

#include <bluetooth/gatt_dm.h>
#include <bluetooth/scan.h>
#include <bluetooth/services/latency.h>
#include <bluetooth/services/latency_client.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/drivers/uart.h>

#include <hal/nrf_radio.h>
#include <helpers/nrfx_gppi.h>
#include <nrfx_gpiote.h>

LOG_MODULE_REGISTER(app_main, LOG_LEVEL_INF);

#define DEVICE_NAME CONFIG_BT_DEVICE_NAME
#define DEVICE_NAME_LEN (sizeof(DEVICE_NAME) - 1)

#define INTERVAL_INITIAL 0x8           /* 8 units, 10 ms */
#define INTERVAL_INITIAL_US 10000      /* 10 ms */
#define INTERVAL_UPDATE_PERIOD_MS 3000 /* Update interval every 3 seconds */

static uint32_t test_intervals[] = {
    0,    /* Will be replaced with minimum supported interval */
    1000, /* 1 ms */
    1250, /* 1.25 ms */
    2000, /* 2 ms */
    4000  /* 4 ms */
};

/** @brief UUID of the SCI Min Interval Service. **/
#define BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE_VAL BT_UUID_128_ENCODE(0x1c840001, 0x49ac, 0x4905, 0x9702, 0x6e836da4cadd)

#define BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE BT_UUID_DECLARE_128(BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE_VAL)

/** @brief UUID of the SCI Min Interval Characteristic. **/
#define BT_UUID_VS_SCI_MIN_INTERVAL_CHAR_VAL BT_UUID_128_ENCODE(0x1c840002, 0x49ac, 0x4905, 0x9702, 0x6e836da4cadd)

#define BT_UUID_VS_SCI_MIN_INTERVAL_CHAR BT_UUID_DECLARE_128(BT_UUID_VS_SCI_MIN_INTERVAL_CHAR_VAL)

static K_SEM_DEFINE(phy_updated, 0, 1);
static K_SEM_DEFINE(min_interval_read_sem, 0, 1);
static K_SEM_DEFINE(frame_space_updated_sem, 0, 1);
static K_SEM_DEFINE(discovery_complete_sem, 0, 1);

static bool test_ready;
static bool initiate_conn_rate_update;
static bool is_central;

static uint32_t latency_response;

static uint16_t local_min_interval_us;
static uint16_t remote_min_interval_us;
static uint16_t common_min_interval_us;
static uint16_t remote_min_interval_handle;

static struct bt_conn *default_conn;
static struct bt_latency latency;
static struct bt_latency_client latency_client;
static struct bt_le_conn_param *conn_param = BT_LE_CONN_PARAM(INTERVAL_INITIAL, INTERVAL_INITIAL, 0, 400);
static struct bt_conn_info conn_info = {0};

static const struct bt_data ad[] = {
    BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
    BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE_VAL),
};

static const struct bt_data sd[] = {
    BT_DATA(BT_DATA_NAME_COMPLETE, DEVICE_NAME, DEVICE_NAME_LEN),
};

/* Example GATT service for exchanging minimum supported connection interval. */
static ssize_t read_min_interval(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len,
                                 uint16_t offset)
{
    uint16_t value = sys_cpu_to_le16(local_min_interval_us);

    return bt_gatt_attr_read(conn, attr, buf, len, offset, &value, sizeof(value));
}

BT_GATT_SERVICE_DEFINE(sci_min_interval_svc, BT_GATT_PRIMARY_SERVICE(BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE),
                       BT_GATT_CHARACTERISTIC(BT_UUID_VS_SCI_MIN_INTERVAL_CHAR, BT_GATT_CHRC_READ, BT_GATT_PERM_READ,
                                              read_min_interval, NULL, NULL));

static const char *phy_to_str(uint8_t phy)
{
    switch (phy)
    {
    case 0:
        return "Unknown";
    case BT_GAP_LE_PHY_1M:
        return "LE 1M";
    case BT_GAP_LE_PHY_2M:
        return "LE 2M";
    case BT_GAP_LE_PHY_CODED:
        return "LE Coded";
    default:
        return "Unknown";
    }
}

static const char *fsu_initiator_to_str(enum bt_conn_le_frame_space_update_initiator initiator)
{
    switch (initiator)
    {
    case BT_CONN_LE_FRAME_SPACE_UPDATE_INITIATOR_LOCAL_HOST:
        return "Local Host";
    case BT_CONN_LE_FRAME_SPACE_UPDATE_INITIATOR_LOCAL_CONTROLLER:
        return "Local Controller";
    case BT_CONN_LE_FRAME_SPACE_UPDATE_INITIATOR_PEER:
        return "Peer";
    default:
        return "Unknown";
    }
}

static void scan_filter_match(struct bt_scan_device_info *device_info, struct bt_scan_filter_match *filter_match,
                              bool connectable)
{
    char addr[BT_ADDR_LE_STR_LEN];

    bt_addr_le_to_str(device_info->recv_info->addr, addr, sizeof(addr));

    LOG_INF("Filters matched. Address: %s connectable: %d", addr, connectable);
}

static void scan_filter_no_match(struct bt_scan_device_info *device_info, bool connectable)
{
    char addr[BT_ADDR_LE_STR_LEN];

    bt_addr_le_to_str(device_info->recv_info->addr, addr, sizeof(addr));

    LOG_INF("Filter does not match. Address: %s connectable: %d", addr, connectable);
}

static void scan_connecting_error(struct bt_scan_device_info *device_info)
{
    LOG_WRN("Connecting failed");
}

BT_SCAN_CB_INIT(scan_cb, scan_filter_match, scan_filter_no_match, scan_connecting_error, NULL);

static void scan_init(void)
{
    int err;
    struct bt_le_scan_param scan_param = {
        .type = BT_LE_SCAN_TYPE_PASSIVE,
        .options = BT_LE_SCAN_OPT_FILTER_DUPLICATE,
        .interval = 0x0010,
        .window = 0x0010,
    };

    struct bt_scan_init_param scan_init = {
        .connect_if_match = true, .scan_param = &scan_param, .conn_param = conn_param};

    bt_scan_init(&scan_init);
    bt_scan_cb_register(&scan_cb);

    err = bt_scan_filter_add(BT_SCAN_FILTER_TYPE_UUID, BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE);
    if (err)
    {
        LOG_WRN("Scanning filters cannot be set (err %d)", err);
        return;
    }

    err = bt_scan_filter_enable(BT_SCAN_UUID_FILTER, false);
    if (err)
    {
        LOG_WRN("Filters cannot be turned on (err %d)", err);
    }
}

static uint8_t read_min_interval_cb(struct bt_conn *conn, uint8_t err, struct bt_gatt_read_params *params,
                                    const void *data, uint16_t length)
{
    if (err)
    {
        LOG_WRN("Failed to read remote min interval (err %u)", err);
        k_sem_give(&min_interval_read_sem);
        return BT_GATT_ITER_STOP;
    }

    if (data && length == sizeof(uint16_t))
    {
        remote_min_interval_us = sys_get_le16(data);
    }

    k_sem_give(&min_interval_read_sem);

    return BT_GATT_ITER_STOP;
}

static int read_remote_min_interval(void)
{
    static struct bt_gatt_read_params read_params;
    int err;

    read_params.func = read_min_interval_cb;
    read_params.handle_count = 1;
    read_params.single.handle = remote_min_interval_handle;
    read_params.single.offset = 0;

