droidecahedron/nrf54_radio_latency_test/sci/src/main.c
    err = bt_gatt_read(default_conn, &read_params);
    if (err)
    {
        LOG_WRN("Failed to initiate read (err %d)", err);
        return err;
    }

    return 0;
}

static void sci_discovery_complete(struct bt_gatt_dm *dm, void *context)
{
    const struct bt_gatt_dm_attr *gatt_chrc;
    const struct bt_gatt_dm_attr *gatt_value;

    LOG_INF("SCI service discovery completed");

    gatt_chrc = bt_gatt_dm_char_by_uuid(dm, BT_UUID_VS_SCI_MIN_INTERVAL_CHAR);
    if (gatt_chrc)
    {
        gatt_value = bt_gatt_dm_attr_next(dm, gatt_chrc);
        if (gatt_value)
        {
            remote_min_interval_handle = gatt_value->handle;
            LOG_INF("Found SCI min interval characteristic, handle: 0x%04x", remote_min_interval_handle);
        }
        else
        {
            LOG_WRN("Failed to get characteristic value attribute");
            return;
        }
    }
    else
    {
        LOG_WRN("SCI min interval characteristic not found");
        return;
    }

    bt_gatt_dm_data_release(dm);

    test_ready = true;
    k_sem_give(&discovery_complete_sem);
}

static void sci_discovery_service_not_found(struct bt_conn *conn, void *context)
{
    LOG_INF("SCI service not found");
}

static void sci_discovery_error(struct bt_conn *conn, int err, void *context)
{
    LOG_INF("Error while discovering SCI service: (err %d)", err);
}

static struct bt_gatt_dm_cb sci_discovery_cb = {
    .completed = &sci_discovery_complete,
    .service_not_found = &sci_discovery_service_not_found,
    .error_found = &sci_discovery_error,
};

static void latency_discovery_complete(struct bt_gatt_dm *dm, void *context)
{
    struct bt_latency_client *latency_client_ctx = context;
    int err;

    LOG_INF("Latency service discovery completed");

    bt_gatt_dm_data_print(dm);
    bt_latency_handles_assign(dm, latency_client_ctx);

    bt_gatt_dm_data_release(dm);

    /* Now discover the SCI min interval service */
    err = bt_gatt_dm_start(default_conn, BT_UUID_VS_SCI_MIN_INTERVAL_SERVICE, &sci_discovery_cb, NULL);
    if (err)
    {
        LOG_WRN("SCI service discovery failed (err %d)", err);
    }
}

static void latency_discovery_service_not_found(struct bt_conn *conn, void *context)
{
    LOG_WRN("Latency service not found");
}

static void latency_discovery_error(struct bt_conn *conn, int err, void *context)
{
    LOG_WRN("Error while discovering GATT database: (err %d)", err);
}

static struct bt_gatt_dm_cb latency_discovery_cb = {
    .completed = &latency_discovery_complete,
    .service_not_found = &latency_discovery_service_not_found,
    .error_found = &latency_discovery_error,
};

static void adv_start(void)
{
    int err;

    err = bt_le_adv_start(BT_LE_ADV_CONN_FAST_2, ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
    if (err)
    {
        LOG_INF("Advertising failed to start (err %d)", err);
        return;
    }

    LOG_INF("Advertising successfully started");
}

static void scan_start(void)
{
    int err;

    err = bt_scan_start(BT_SCAN_TYPE_SCAN_PASSIVE);
    if (err)
    {
        LOG_WRN("Starting scanning failed (err %d)", err);
        return;
    }

    LOG_INF("Scanning successfully started");
}

static void connected(struct bt_conn *conn, uint8_t err)
{
    if (err)
    {
        LOG_WRN("Connection failed, err 0x%02x %s", err, bt_hci_err_to_str(err));
        return;
    }

    default_conn = bt_conn_ref(conn);
    err = bt_conn_get_info(default_conn, &conn_info);
    if (err)
    {
        LOG_WRN("Getting conn info failed (err %d)", err);
        return;
    }

    /* make sure we're not scanning or advertising */
    if (conn_info.role == BT_CONN_ROLE_CENTRAL)
    {
        bt_scan_stop();
    }
    else
    {
        bt_le_adv_stop();
    }

    LOG_INF("Connected as %s", conn_info.role == BT_CONN_ROLE_CENTRAL ? "central" : "peripheral");
    LOG_INF("Conn. interval is %u us", conn_info.le.interval_us);

#if defined(CONFIG_BT_SMP)
    if (conn_info.role == BT_CONN_ROLE_PERIPHERAL)
    {
        err = bt_conn_set_security(conn, BT_SECURITY_L2);
        if (err)
        {
            LOG_WRN("Failed to set security: %d", err);
        }
    }
#else
    /* Start discovery immediately if encryption is not enabled */
    err = bt_gatt_dm_start(default_conn, BT_UUID_LATENCY, &latency_discovery_cb, &latency_client);
    if (err)
    {
        LOG_WRN("Discover failed (err %d)", err);
    }
#endif /* CONFIG_BT_SMP */
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
    LOG_INF("Disconnected, reason 0x%02x %s", reason, bt_hci_err_to_str(reason));

    test_ready = false;

    if (default_conn)
    {
        bt_conn_unref(default_conn);
        default_conn = NULL;
    }

    /* Restart scanning or advertising based on configured role */
    if (is_central)
    {
        LOG_INF("Reconnecting as central");
        scan_start();
    }
    else
    {
        LOG_INF("Reconnecting as peripheral");
        adv_start();
    }
}

#if defined(CONFIG_BT_SMP)
void security_changed(struct bt_conn *conn, bt_security_t level, enum bt_security_err err)
{
    LOG_INF("Security changed: level %i, err: %i %s", level, err, bt_security_err_to_str(err));

    if (err != 0)
    {
        LOG_WRN("Failed to encrypt link");
        bt_conn_disconnect(conn, BT_HCI_ERR_PAIRING_NOT_SUPPORTED);
        return;
    }

    /* Start service discovery when link is encrypted */
    int gatt_err = bt_gatt_dm_start(default_conn, BT_UUID_LATENCY, &latency_discovery_cb, &latency_client);
    if (gatt_err)
    {
        LOG_WRN("Discover failed (err %d)", gatt_err);
    }
}
#endif /* CONFIG_BT_SMP */

static bool le_param_req(struct bt_conn *conn, struct bt_le_conn_param *param)
{
    /* Ignore peer parameter preferences. */
    return false;
}

static int set_conn_rate_defaults(uint32_t interval_min_us, uint32_t interval_max_us)
{
    const struct bt_conn_le_conn_rate_param params = {
        .interval_min_125us = interval_min_us / 125,
        .interval_max_125us = interval_max_us / 125,
        .subrate_min = 1,
        .subrate_max = 1,
        .max_latency = 5,
        .continuation_number = 0,
        .supervision_timeout_10ms = 400,
        .min_ce_len_125us = BT_HCI_LE_SCI_CE_LEN_MIN_125US,
        .max_ce_len_125us = BT_HCI_LE_SCI_CE_LEN_MAX_125US,
    };

    int err = bt_conn_le_conn_rate_set_defaults(&params);

    if (err)
    {
        LOG_WRN("Set default rate parameters failed (err %d)", err);
        return err;
    }

    LOG_INF("SCI default connection rate parameters set (min=%u us, max=%u us)", interval_min_us, interval_max_us);
    return 0;
}

static int select_lowest_frame_space(void)
{
    const struct bt_conn_le_frame_space_update_param params = {
        .phys = BT_HCI_LE_FRAME_SPACE_UPDATE_PHY_2M_MASK,
        .spacing_types = BT_CONN_LE_FRAME_SPACE_TYPES_MASK_ACL_IFS,
        .frame_space_min = 0,
        .frame_space_max = 150,
    };

