droidecahedron/nrf54_radio_latency_test/sci/src/main.c
    int err = bt_conn_le_frame_space_update(default_conn, &params);

    if (err)
    {
        LOG_WRN("Frame space update request failed (err %d)", err);
        return err;
    }

    /* Wait for frame space update to complete */
    k_sem_take(&frame_space_updated_sem, K_FOREVER);
    return 0;
}

static int conn_rate_request(uint32_t interval_min_us, uint32_t interval_max_us)
{
    const struct bt_conn_le_conn_rate_param params = {
        .interval_min_125us = interval_min_us / 125,
        .interval_max_125us = interval_max_us / 125,
        .subrate_min = 1,
        .subrate_max = 1,
        .max_latency = 0,
        .continuation_number = 0,
        .supervision_timeout_10ms = 400,
        .min_ce_len_125us = BT_HCI_LE_SCI_CE_LEN_MIN_125US,
        .max_ce_len_125us = BT_HCI_LE_SCI_CE_LEN_MAX_125US,
    };

    int err = bt_conn_le_conn_rate_request(default_conn, &params);

    if (err)
    {
        LOG_WRN("Connection rate request failed (err %d)", err);
        return err;
    }

    return 0;
}

static void conn_rate_changed(struct bt_conn *conn, uint8_t status, const struct bt_conn_le_conn_rate_changed *params)
{
    if (status == BT_HCI_ERR_SUCCESS)
    {
        LOG_INF("Connection rate changed: "
                "interval %u us, "
                "subrate factor %d, "
                "peripheral latency %d, "
                "continuation number %d, "
                "supervision timeout %d ms",
                params->interval_us, params->subrate_factor, params->peripheral_latency, params->continuation_number,
                params->supervision_timeout_10ms * 10);
    }
    else
    {
        LOG_WRN("Connection rate change failed (HCI status 0x%02x %s)", status, bt_hci_err_to_str(status));
    }
}

static int update_to_2m_phy(void)
{
    struct bt_conn_le_phy_param phy;

    phy.options = BT_CONN_LE_PHY_OPT_NONE;
    phy.pref_rx_phy = BT_GAP_LE_PHY_2M;
    phy.pref_tx_phy = BT_GAP_LE_PHY_2M;

    int err = bt_conn_le_phy_update(default_conn, &phy);

    if (err)
    {
        LOG_WRN("PHY update failed: %d", err);
        return err;
    }

    k_sem_take(&phy_updated, K_FOREVER);
    return 0;
}

static void le_phy_updated(struct bt_conn *conn, struct bt_conn_le_phy_info *param)
{
    LOG_INF("LE PHY updated: TX PHY %s, RX PHY %s", phy_to_str(param->tx_phy), phy_to_str(param->rx_phy));
    k_sem_give(&phy_updated);
}

static void frame_space_updated(struct bt_conn *conn, const struct bt_conn_le_frame_space_updated *params)
{
    if (params->status == BT_HCI_ERR_SUCCESS)
    {
        LOG_INF("Frame space updated: %u us, PHYs: 0x%02x, spacing types: 0x%04x, "
                "initiator: %s",
                params->frame_space, params->phys, params->spacing_types, fsu_initiator_to_str(params->initiator));
    }
    else
    {
        LOG_WRN("Frame space update failed (HCI status 0x%02x %s)", params->status, bt_hci_err_to_str(params->status));
    }

    k_sem_give(&frame_space_updated_sem);
}

static void latency_response_handler(const void *buf, uint16_t len)
{
    uint32_t latency_time;

    if (len == sizeof(latency_time))
    {
        /* compute how much time was spent */
        latency_time = *((uint32_t *)buf);
        uint32_t cycles_spent = k_cycle_get_32() - latency_time;

        latency_response = (uint32_t)k_cyc_to_ns_floor64(cycles_spent) / 2000;
    }
}

static const struct bt_latency_client_cb latency_client_cb = {.latency_response = latency_response_handler};

static void test_run(void)
{
    int err;

    if (!test_ready)
    {
        /* disconnected while blocking inside _getchar() */
        return;
    }

    test_ready = false;

    /* Update link parameters to satisfy minimum supported connection interval requirements. */
    if (initiate_conn_rate_update)
    {
        /* The lowest connection intervals can only be achieved on the 2M PHY. */
        err = update_to_2m_phy();
        if (err)
        {
            return;
        }

        /* A smaller frame space is required. */
        err = select_lowest_frame_space();
        if (err)
        {
            LOG_WRN("Frame space update failed (err %d)", err);
            return;
        }
    }

    /* Read remote min interval if characteristic was found */
    if (remote_min_interval_handle != 0)
    {
        err = read_remote_min_interval();
        if (err == 0)
        {
            k_sem_take(&min_interval_read_sem, K_FOREVER);

            /* Select the shortest interval supported by both devices. */
            common_min_interval_us = MAX(local_min_interval_us, remote_min_interval_us);
            test_intervals[0] = common_min_interval_us;

            LOG_INF("Minimum connection intervals: Local: %u us, Peer: %u us, "
                    "Common: %u us",
                    local_min_interval_us, remote_min_interval_us, common_min_interval_us);
        }
    }

    uint8_t interval_index = 0;
    int64_t next_update_time = 0;

    /* Start sending timestamps to the peer device */
    while (default_conn)
    {
        uint32_t time = k_cycle_get_32();

        err = bt_latency_request(&latency_client, &time, sizeof(time));
        if (err && err != -EALREADY)
        {
            LOG_WRN("Latency failed (err %d)", err);
        }

        k_sleep(K_MSEC(200)); /* wait for latency response */

        if (latency_response)
        {
            LOG_INF("Transmission Latency: %u us", latency_response);
        }
        else
        {
            LOG_WRN("Did not receive a latency response");
        }

        latency_response = 0;

        if (initiate_conn_rate_update)
        {
            int64_t current_time = k_uptime_get();

            if (current_time >= next_update_time)
            {
                next_update_time = current_time + INTERVAL_UPDATE_PERIOD_MS;

                uint32_t new_interval_us = test_intervals[interval_index];

                LOG_INF("Requesting new connection interval: %u us", new_interval_us);

                /* As a central, the lowest supported interval of the peripheral
                 * needs to be obtained before initiating a connection rate request,
                 * as interval_min cannot be lower than the peripheral's minimum
                 * supported interval. As a peripheral, calculating the common
                 * minimum interval is optional, as requesting a range will allow
                 * the central to select the lowest interval it can support.
                 */
                err = conn_rate_request(new_interval_us, INTERVAL_INITIAL_US);

                if (err)
                {
                    LOG_WRN("Connection rate update failed (err %d)", err);
                    return;
                }

                /* Move to next interval in the sequence */
                interval_index = (interval_index + 1) % ARRAY_SIZE(test_intervals);
            }
        }
    }
}

BT_CONN_CB_DEFINE(conn_callbacks) = {
    .connected = connected,
    .disconnected = disconnected,
    .le_phy_updated = le_phy_updated,
    .le_param_req = le_param_req,
    .conn_rate_changed = conn_rate_changed,
    .frame_space_updated = frame_space_updated,
#if defined(CONFIG_BT_SMP)
    .security_changed = security_changed,
#endif /* CONFIG_BT_SMP */
};

#define RADIO_MON_PIN NRF_GPIO_PIN_MAP(1, 11) // 42 P1.11 (connected on p1, unused), NRF_GPIO_PIN_MAP(1, 11)
static nrfx_gpiote_t gpiote_inst = NRFX_GPIOTE_INSTANCE(NRF_GPIOTE20);
// static nrfx_gppi_t gppi_inst;
static nrfx_gppi_handle_t gppi_ready_handle;
static nrfx_gppi_handle_t gppi_disabled_handle;

