droidecahedron/nrf54_radio_latency_test/sci/src/main.c
void radio_activity_mon(void)
{
    nrfx_err_t err;
    uint8_t gpiote_channel;

    if (!nrfx_gpiote_init_check(&gpiote_inst))
    {
        err = nrfx_gpiote_init(&gpiote_inst, NRFX_GPIOTE_DEFAULT_CONFIG_IRQ_PRIORITY);
        if (err != 0)
        {
            LOG_ERR("nrfx_gpiote_init failed: 0x%08X", err);
            return;
        }
    }
    err = nrfx_gpiote_channel_alloc(&gpiote_inst, &gpiote_channel);
    if (err != 0)
    {
        LOG_ERR("nrfx_gpiote_channel_alloc failed: 0x%08X", err);
        return;
    }
    const nrfx_gpiote_output_config_t out_cfg = {
        .drive = NRF_GPIO_PIN_S0S1,
        .input_connect = NRF_GPIO_PIN_INPUT_DISCONNECT,
        .pull = NRF_GPIO_PIN_NOPULL,
    };

    const nrfx_gpiote_task_config_t task_cfg = {
        .task_ch = gpiote_channel,
        .polarity = NRF_GPIOTE_POLARITY_TOGGLE,   /* Task pin, we will use SET/CLR tasks */
        .init_val = NRF_GPIOTE_INITIAL_VALUE_LOW, /* Start low */
    };
    err = nrfx_gpiote_output_configure(&gpiote_inst, RADIO_MON_PIN, &out_cfg, &task_cfg);
    if (err != 0)
    {
        LOG_ERR("nrfx_gpiote_output_configure failed: 0x%08X", err);
        return;
    }
    nrfx_gpiote_out_task_enable(&gpiote_inst, RADIO_MON_PIN);

    uint32_t eep_ready = nrf_radio_event_address_get(NRF_RADIO, NRF_RADIO_EVENT_READY);
    uint32_t eep_disabled = nrf_radio_event_address_get(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);

    uint32_t tep_set = nrfx_gpiote_set_task_address_get(&gpiote_inst, RADIO_MON_PIN);
    uint32_t tep_clr = nrfx_gpiote_clr_task_address_get(&gpiote_inst, RADIO_MON_PIN);
    /* SET/CLR task address helpers are provided by nrfx_gpiote.[[nrfx_gpiote
     * tasks](https://docs.nordicsemi.com/bundle/nrfx-apis-latest/page/group_nrfx_gpiote.html)] */

//    nrfx_gppi_init(&gppi_inst); // mpsl probably calling this. hardfault if u do this.
    /* required once before using GPPI [[nrfx 4.0
                    GPPI](https://docs.nordicsemi.com/bundle/nrfx-apis-latest/page/md_doc_2nrfx_4_0_migration_guide.html#autotoc_md30)]
                  */

    /* READY -> SET (pin high) */
    err = nrfx_gppi_conn_alloc(eep_ready, tep_set, &gppi_ready_handle);
    if (err != 0)
    {
        LOG_ERR("nrfx_gppi_conn_alloc(READY) failed: 0x%08X", err);
        return;
    }

    /* DISABLED -> CLR (pin low) */
    err = nrfx_gppi_conn_alloc(eep_disabled, tep_clr, &gppi_disabled_handle);
    if (err != 0)
    {
        LOG_ERR("nrfx_gppi_conn_alloc(DISABLED) failed: 0x%08X", err);
        return;
    }

    nrfx_gppi_conn_enable(gppi_ready_handle);
    nrfx_gppi_conn_enable(gppi_disabled_handle);

    LOG_INF("Radio activity monitor on P1.11 initialized");
}

int main(void)
{
    int err;

    console_init();

        radio_activity_mon();

    LOG_INF("Starting Bluetooth Shorter Connection Intervals sample");
    err = bt_enable(NULL);
    if (err)
    {
        LOG_WRN("Bluetooth init failed (err %d)", err);
        return 0;
    }

    LOG_INF("Bluetooth initialized");

    /* Read local minimum connection interval */
    err = bt_conn_le_read_min_conn_interval(&local_min_interval_us);
    if (err)
    {
        LOG_WRN("Failed to read min conn interval (err %d)", err);
        return 0;
    }
    LOG_INF("Local minimum connection interval: %u us", local_min_interval_us);

    /* Set the initial allowed range of parameters that can be requested by the peripheral.
     * They will be overridden by any calls to bt_conn_le_conn_rate_request().
     */
    err = set_conn_rate_defaults(local_min_interval_us, INTERVAL_INITIAL_US);
    if (err)
    {
        LOG_WRN("Failed to set conn rate defaults");
        return 0;
    }

    err = bt_latency_init(&latency, NULL);
    if (err)
    {
        LOG_WRN("Latency service initialization failed (err %d)", err);
        return 0;
    }

    err = bt_latency_client_init(&latency_client, &latency_client_cb);
    if (err)
    {
        LOG_WRN("Latency client initialization failed (err %d)", err);
        return 0;
    }

    while (true)
    {
        LOG_INF("Should this device initiate connection interval updates?\n"
                "Type y (yes, this device will initiate) or n (no, peer will initiate): ");

        char input_char = console_getchar();

        LOG_INF("");

        if (input_char == 'y')
        {
            initiate_conn_rate_update = true;
            LOG_INF("This device will initiate connection interval updates");
            break;
        }
        else if (input_char == 'n')
        {
            initiate_conn_rate_update = false;
            LOG_INF("The peer device will initiate connection interval updates");
            break;
        }

        LOG_INF("Invalid input");
    }

    while (true)
    {
        LOG_INF("Choose device role - type c (central) or p (peripheral): ");

        char input_char = console_getchar();

        LOG_INF("");

        if (input_char == 'c')
        {
            is_central = true;
            LOG_INF("Central. Starting scanning");
            scan_init();
            scan_start();
            break;
        }
        else if (input_char == 'p')
        {
            is_central = false;
            LOG_INF("Peripheral. Starting advertising");
            adv_start();
            break;
        }

        LOG_INF("Invalid role");
    }

    for (;;)
    {
        /* Wait for service discovery to complete */
        k_sem_take(&discovery_complete_sem, K_FOREVER);

        test_run();
    }
}
